app/controllers/students_controller.rb

INSERT INTO "students" ("name", "genre", "date_birth", "weight", "email", "color", "school", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(student_params)

    if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "soda faye"], ["updated_at", "2023-05-11 12:39:57.222948"], ["id", 3]]
---
  def update
    @student = Student.find(params[:id])

    if @student.update(student_params)

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 4]]
---
  def destroy
    @student = Student.find(params[:id])
    @student.destroy